{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v2.7.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of65.bin", "group1-shard2of65.bin", "group1-shard3of65.bin", "group1-shard4of65.bin", "group1-shard5of65.bin", "group1-shard6of65.bin", "group1-shard7of65.bin", "group1-shard8of65.bin", "group1-shard9of65.bin", "group1-shard10of65.bin", "group1-shard11of65.bin", "group1-shard12of65.bin", "group1-shard13of65.bin", "group1-shard14of65.bin", "group1-shard15of65.bin", "group1-shard16of65.bin", "group1-shard17of65.bin", "group1-shard18of65.bin", "group1-shard19of65.bin", "group1-shard20of65.bin", "group1-shard21of65.bin", "group1-shard22of65.bin", "group1-shard23of65.bin", "group1-shard24of65.bin", "group1-shard25of65.bin", "group1-shard26of65.bin", "group1-shard27of65.bin", "group1-shard28of65.bin", "group1-shard29of65.bin", "group1-shard30of65.bin", "group1-shard31of65.bin", "group1-shard32of65.bin", "group1-shard33of65.bin", "group1-shard34of65.bin", "group1-shard35of65.bin", "group1-shard36of65.bin", "group1-shard37of65.bin", "group1-shard38of65.bin", "group1-shard39of65.bin", "group1-shard40of65.bin", "group1-shard41of65.bin", "group1-shard42of65.bin", "group1-shard43of65.bin", "group1-shard44of65.bin", "group1-shard45of65.bin", "group1-shard46of65.bin", "group1-shard47of65.bin", "group1-shard48of65.bin", "group1-shard49of65.bin", "group1-shard50of65.bin", "group1-shard51of65.bin", "group1-shard52of65.bin", "group1-shard53of65.bin", "group1-shard54of65.bin", "group1-shard55of65.bin", "group1-shard56of65.bin", "group1-shard57of65.bin", "group1-shard58of65.bin", "group1-shard59of65.bin", "group1-shard60of65.bin", "group1-shard61of65.bin", "group1-shard62of65.bin", "group1-shard63of65.bin", "group1-shard64of65.bin", "group1-shard65of65.bin"], "weights": [{"name": "tf_distil_bert_model/distilbert/embeddings/word_embeddings/weight", "shape": [32000, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/embeddings/position_embeddings/embeddings", "shape": [512, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/embeddings/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/embeddings/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/attention/q_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/attention/q_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/attention/k_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/attention/k_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/attention/v_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/attention/v_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/attention/out_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/attention/out_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/sa_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/sa_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/ffn/lin1/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/ffn/lin1/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/ffn/lin2/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/ffn/lin2/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._0/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/attention/q_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/attention/q_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/attention/k_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/attention/k_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/attention/v_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/attention/v_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/attention/out_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/attention/out_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/sa_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/sa_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/ffn/lin1/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/ffn/lin1/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/ffn/lin2/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/ffn/lin2/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._1/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/attention/q_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/attention/q_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/attention/k_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/attention/k_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/attention/v_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/attention/v_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/attention/out_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/attention/out_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/sa_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/sa_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/ffn/lin1/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/ffn/lin1/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/ffn/lin2/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/ffn/lin2/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._2/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/attention/q_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/attention/q_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/attention/k_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/attention/k_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/attention/v_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/attention/v_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/attention/out_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/attention/out_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/sa_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/sa_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/ffn/lin1/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/ffn/lin1/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/ffn/lin2/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/ffn/lin2/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._3/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/attention/q_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/attention/q_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/attention/k_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/attention/k_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/attention/v_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/attention/v_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/attention/out_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/attention/out_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/sa_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/sa_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/ffn/lin1/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/ffn/lin1/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/ffn/lin2/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/ffn/lin2/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._4/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/attention/q_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/attention/q_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/attention/k_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/attention/k_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/attention/v_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/attention/v_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/attention/out_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/attention/out_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/sa_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/sa_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/ffn/lin1/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/ffn/lin1/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/ffn/lin2/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/ffn/lin2/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_model/distilbert/transformer/layer_._5/output_layer_norm/beta", "shape": [768], "dtype": "float32"}]}]}